import 'package:expandable/expandable.dart';
import 'package:flutter/material.dart';
import 'package:flutter_faq/flutter_faq.dart';
import 'package:hayah/shared/components/faq.dart';

class FAQScreen extends StatelessWidget {
  const FAQScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Directionality(
      textDirection: TextDirection.rtl,
      child: Scaffold(
        body: ExpandableTheme(
          data: const ExpandableThemeData(
            iconColor: Colors.blue,
            useInkWell: true,
          ),
          child: ListView(
            physics: BouncingScrollPhysics(),
            children: <Widget>[
              FaqCard("لماذا ينبغي أن يتبرع الأفراد بالدم؟",
                  "الدم المأمون ينقذ الأرواح. والدم تحتاجه النساء اللائي يعانين من مضاعفات أثناء الحمل والإنجاب، والأطفال المصابون بفقر الدم الحاد، الذي ينتج غالبا عن الملاريا أو سوء التغذية، وضحايا الحوادث والمرضى الذين يجرون عمليات جراحية ومرضى السرطان.هناك حاجة مستمرة إلى إمدادات منتظمة بالدم لأنه لا يمكن تخزينه إلا لفترة محدودة قبل استخدامه. وهناك حاجة إلى تبرع عدد كاف من الأفراد الأصحاء بالدم بانتظام لضمان بقاء الدم متاحا حيثما ومتى كان مطلوباوالدم هو أغلى هبة يمكن لأي فرد أن يهبها شخصا آخر- إنه هبة الحياة. ويمكن لقرار التبرع بدمك أن ينقذ حياة فرد واحد بل حتى حياة أفراد كثر إذا فُرزت من دمك مكوناته- الكريات الحمراء، والصُفَيْحَات، والبلازما- التي يمكن استخدامها على حدة عند المرضى الذين يعانون من أمراض خاصة. "),
              FaqCard("ماذا يحدث لي عندما أتبرع بالدم؟",
                  "سواء كانت هذه أول مرة تتبرع فيها بالدم أو كنت مواظبا على التبرع بالدم، فعلى خدمة نقل الدم أن تتأكد من ألا يلحقك أي ضرر بسبب التبرع بالدم. ويشمل ذلك فحص دمك للتأكد من خلوه من أي مخاطر على الشخص الذي يتلقاه.قبل أن تتبرع بالدم، ستُسأل أسئلة عن سجلك الطبي، بما في ذلك عن أي أدوية تتناولها، وعن صحتك وأسلوب حياتك حاليا، وقد تُسأل أيضا عن أسفارك مؤخرا؛ وإذا كنت تعيش في بلد خال من الملاريا، مثلا، فقد تُسأل إن كنت قد زرت بلدا مداريا في الآونة الأخيرة. ولا تسأل هذه الأسئلة إلا من باب الحرص على صحتك وصحة الشخص الذي سيتلقى دمك. وإذا كنت مؤهلا للتبرع بالدم فتسبلغ بذلك، وإذا لم تكن كذلك، فستبلغ إن كنت ستكون قادرا على التبرع بالدم في المستقبل. وسيحتفظ بسرية كل المعلومات الشخصية التي تقدمها ولن تستخدم لأي غرض آخر.من المهم للغاية أن تكون صريحا فتذكر أي أسباب قد تجعل دمك غير صالح للتبرع به. وبالرغم من أن الدم يختبر دوما للكشف عن أي إصابات قد تنقل عبر نقله، مثل فيروس نقص المناعة البشرية والتهاب الكبد B وCالتبرع بالدم عملية بسيطة للغاية. سيُحرص على أن تكون في وضع مريح قدر الإمكان، عادة فوق كرسي مخصص للغرض أو على سرير. وسينظف موضع داخل أحد مرفقيك بمحلول مضاد للبكتيريا قبل أن أي يأتي عامل صحي متمرس ويغرز إبرة معقمة موصولة بكيس لجمع الدم من وريدك. يستغرق التبرع بالدم عادة نحو 10 دقائق.بعد أخذ استراحة لمدة 10 دقائق أو 15 دقيقة، وتناول بعض المرطبات، ستصبح قادرا على استئناف أنشطتك المعتادة، لكن ينبغي أن تتجنب أي نشاط مرهق لما تبقى من اليوم. وينبغي أن تشرب قدرا كافيا من السوائل خلال ـ24 ساعة التالية. "),
              FaqCard(
                  "كم مقدار الدم الذي سيؤخذ؟ وهل سيظل عندي ما يكفي من الدم؟",
                  "في معظم البلدان، يصل مقدار الدم المأخوذ هو 450 مل، أي أقل من 10% من مجموع حجم الدم (يتراوح حجم الدم في جسم البالغ بين 4.5 و5 لترات). وفي بعض البلدان، يؤخذ حجم أقل. سيعوض جسمك السائل المفقود في غضون 36 ساعة."),
              FaqCard("هل إعطاء الدم مأمون؟",
                  "نعم. تذكر أنك ستقبل كمتبرع بالدم فقط إذا كنت سليما ومعافى. وصحتك وعافيتك أمران مهمان للغاية بالنسبة لخدمة نقل الدم. الإبرة وكيس الدم المستخدم لجمع الدم يأتيان في حزمة معقمة تستخدم مرة واحدة. ومن ثم فإن العملية مأمونة إلى أقصى حد ممكن."),
              FaqCard(
                  "هل العملية مؤلمة؟",
                  "اضغط فقط على الجزء الداخلي من مرفقك بشدة، وستحصل على فكرة سريعة عن الشعور الذي ستحس به عند وخزك بالإبرة. كل ما ستشعر به هو ضغط خفيف وإحساس مؤقت شبيه بـ"
                      "وخزة دبوس"
                      ". والتبرع بالدم مأمون جدا ومن النادر جدا الشعور بعدم ارتياح أو مشكلة أثناء التبرع أو بعده. "),
              FaqCard("من يمكنه إعطاء الدم وكم مرة يمكنه ذلك؟",
                  "تختلف معايير انتقاء المتبرعين من بلد لآخر، لكن التبرع بالدم متاح لكل الأفراد المتعافين الذين لا يعانون من أي إصابة يمكن نقلها عبر الدم. يختلف العمر المؤهل للتبرع بالدم، لكنه يتراوح عادة بين 17 و65 سنة. وتقبل بعض البلدان التبرع بالدم من أشخاص تترواح أعمارهم من  16 سنة وما فوق سن  65 سنة.يمكن للبالغين الأصحاء إعطاء الدم بانتظام، على الأقل مرتين في العام. ويمكن لخدمة نقل الدم المحلية أن تخبرك عن تواتر المرات التي يمكنك إعطاء الدم فيها. "),
              FaqCard("من ينصح بعدم التبرع بالدم؟",
                  "تهتم خدمة نقل الدم بصحة المتبرع بالدم ومتلقيه. ويطلب عادة من المتبرعين بالدم ألا يتبرعوا بالدم لفترة معينة حرصا على سلامتهم أو سلامة مخزون الدم. \nلا ينبغي لك أن تتبرع بالدم إذا كانت صحتك قد تعاني نتيجة ذلك. والشغل الشاغل لخدمة نقل الدم هو ضمان عدم تعرض المتبرع بالدم لأي ضرر بسبب التبرع. ولا ينبغي أن تتبرع بالدم:\n\nإذا كنت مصابا بفقر الدم\nإذا كنتِ امرأة حاملا، أو كنتِ حاملا في السنة السابقة أو كنتِ مرضعا. \nإذا كنت مصابا بأمراض معينة لا تؤهلك لأن تكون متبرعا.\n. \nقد تصبح قادرا على التبرع الدم في وقت لاحق. وفي بعض الحالات، لن تكون قادرا على التبرع بالدم، حماية لصحتك.\nلا ينبغي أن تتبرع بالدم إذا كان دمك قد يلحق الضرر بالمريض الذي يتلقى الدم. والدم يمكنه أن ينقل إصابات تهدد حياة من من ينقل إليهم الدم. لا ينبغي أن تتبرع بالدم:  \nو الزهري، يمكن نقله إلى مريض يتلقى دمك. \nإذا كان أسلوب حياتك يعرضك لإصابة يمكن أن تنقل عبر دمك. مثلا إذا كان لديك أكثر من شريك جنسي أو كنت تقيم علاقات جنسية مع العاملات في الجنس\nإذا كنت قد حقنت بمخدرات ترفيهية غير طبية \nإذا كنت موشوما أو لديك ندوب في الجلد أو ثقوب للزينة في الجس\nطلوب الانتظار قبل إعطاء الدم\nإذا كنت قد أقمت علاقات جنسية مع أي من أفراد الفئات المذكورة أعلاه."),
              FaqCard("كيف سيكون شعوري بعد إعطاء الدم؟",
                  "ستشعر بشعور رائع لأنك آثرت غيرك وجدت عليه بهبة الدم. "),
              FaqCard(
                  "هل يمكنني أن أتبرع بالدم بعد التطعيم بلقاح مضاد لفيروس كورونا-سارس-2 ؟",
                  "تشير الأدلة الحالية إلى أنه يمكنك أن تتبرع بالدم إذا كنت قد تلقيت لقاحا مضادا لفيروس كورونا-سارس-2 لا يحتوي أي فيروس حي وكنت معافى. ونظرا لأن اللقاحات المضادة لفيروس كورونا-سارس-2 حديثة العهد، فقد ترتئي خدمة نقل الدم الوطنية إرجاء التبرع بالدم لمدة سبعة أيام للتقليل إلى الحد الأدنى من احتمال ظهور أعراض متعلقة بالتطعيم بعد التبرع بالدم. \nأما من يتلقون لقاحات محتوية على فيروس حي (مثل لقاحات مستندة إلى ناقل فيروس أو لقاحات بفيروس حي مخفف) فينبغي لهم تأجيل التبرع لأربعة أسابيع \nإذا شعرت بتوعك بعد تلقيك لقاحا مضادا لفيروس كورونا-سارس-2، فينبغي تأجيل التبرع بالدم لمدة سبعة أيام بعد التعافي التام من الأعراض.\n")
            ],
          ),
        ),
      ),
    );
  }
}
